import styles from "./FAQList.module.scss";
import DetailsDropdownList from "@/app/common_ui/animated_components/DetailsDropdownList/DetailsDropdownList";

const list = [
	{
		title: "Як записатися на прийом?",
		text: "Ви можете записатися на прийом через наш сайт, зателефонувати до рецепції або відвідати наш медичний центр особисто",
	},
	{
		title: "Чи потрібне направлення від лікаря?",
		text: "Направлення не обов'язкове, але воно може допомогти нашим фахівцям краще розуміти ваші потреби і стан здоров'я",
	},
	{
		title: "Чи покриває страхування ваші послуги?",
		text: "Так, багато страхових компаній покривають наші послуги. Будь ласка, уточніть у своїй страховій компанії деталі вашого полісу",
	},
	{
		title: "Скільки часу триває курс реабілітації?",
		text: "Тривалість реабілітаційного курсу залежить від індивідуальних потреб пацієнта та плану лікування, розробленого нашим фахівцем",
	},
	{
		title: "Які методи фізіотерапії ви використовуєте?",
		text: "Ми використовуємо різноманітні методи фізіотерапії, включаючи електротерапію, масаж, лазерну терапію, ультразвукову терапію та лікувальну фізкультуру",
	},
	{
		title: "Чи є послуги для пацієнтів з обмеженими можливостями?",
		text: "Так, наш медичний центр облаштований для комфортного перебування пацієнтів з обмеженими можливостями, і наші фахівці мають досвід роботи з такими пацієнтами",
	},
];

export default function FAQList() {
	return (
		<div className={styles.container}>
			{list.map((item, i) => {
				return (
					<DetailsDropdownList
						title={item.title}
						text={item.text}
						className={styles.dropdown}
						key={i}
					/>
				);
			})}
		</div>
	);
}
