import styles from "./page.module.scss";
import Image from "next/image";
import logo from "@/public/icons/logo.svg";
import avatars from "@/public/images/client/main_hero_avatars.png";
import doctor from "@/public/images/client/what_we_treat_home_page.png";
import Link from "next/link";
import { fetchWhatWeTreats } from "@/app/services/client/fetchData.service";
import { Suspense } from "react";
import WhatWeTreatHomeLists from "@/app/(client)/ui/Home/WhatWeTreatHomeList/WhatWeTreatHomeLists";
import WhatWeTreatHomeListsFallback from "@/app/(client)/ui/Home/WhatWeTreatHomeList/fallback/WhatWeTreatHomeListsFallback";

export default async function Home() {
	const whatWeTreatList = fetchWhatWeTreats();

	return (
		<div className={styles.page}>
			<section className={styles.heroSection}>
				<div className={`container ${styles.container}`}>
					<div>
						<Image src={logo} alt={"Logo"} />
						<h1>медичний центр фізичної реабілітації</h1>
					</div>

					<div className={styles.description}>
						<h2>
							{/*todo maybe their count may change*/}
							<span>2128 задоволених пацієнтів </span>
							<Image src={avatars} alt={"Avatars"} />
							<span>та професійна мультидсциплінарна </span>
							<span>команда лікарів і фізичних терапевтів</span>
						</h2>
						<p>
							Запишіться на прийом до наших досвідчених фахівців та отримайте
							індивідуальний підхід що забезпечить ефективне відновлення вашого
							здоров'я.
						</p>
					</div>

					<div className={styles.buttons}>
						<div className={`btn yellow xxl brown ${styles.infoBtn}`}>
							<svg
								xmlns="http://www.w3.org/2000/svg"
								width="44"
								height="44"
								viewBox="0 0 44 44"
								fill="none"
							>
								<path
									d="M23.8335 1.83333C23.8335 1.3471 24.0266 0.880786 24.3704 0.536969C24.7143 0.193152 25.1806 -1.9134e-06 25.6668 -1.9134e-06C30.5275 0.00533601 35.1875 1.93859 38.6245 5.3756C42.0615 8.81261 43.9948 13.4727 44.0001 18.3333C44.0001 18.8196 43.807 19.2859 43.4632 19.6297C43.1194 19.9735 42.653 20.1667 42.1668 20.1667C41.6806 20.1667 41.2143 19.9735 40.8704 19.6297C40.5266 19.2859 40.3335 18.8196 40.3335 18.3333C40.3291 14.4448 38.7825 10.7168 36.0329 7.96726C33.2833 5.21767 29.5553 3.67103 25.6668 3.66666C25.1806 3.66666 24.7143 3.47351 24.3704 3.12969C24.0266 2.78588 23.8335 2.31956 23.8335 1.83333ZM25.6668 11C27.6117 11 29.477 11.7726 30.8523 13.1479C32.2275 14.5231 33.0001 16.3884 33.0001 18.3333C33.0001 18.8196 33.1933 19.2859 33.5371 19.6297C33.8809 19.9735 34.3472 20.1667 34.8335 20.1667C35.3197 20.1667 35.786 19.9735 36.1298 19.6297C36.4737 19.2859 36.6668 18.8196 36.6668 18.3333C36.6639 15.4168 35.504 12.6206 33.4418 10.5584C31.3795 8.4961 28.5833 7.33624 25.6668 7.33333C25.1806 7.33333 24.7143 7.52649 24.3704 7.8703C24.0266 8.21412 23.8335 8.68043 23.8335 9.16667C23.8335 9.65289 24.0266 10.1192 24.3704 10.463C24.7143 10.8068 25.1806 11 25.6668 11ZM42.3373 30.6882C43.3997 31.7535 43.9964 33.1967 43.9964 34.7013C43.9964 36.2059 43.3997 37.6491 42.3373 38.7145L40.669 40.6377C25.654 55.0128 -10.8844 18.4837 3.26897 3.421L5.3773 1.58766C6.44388 0.554906 7.87418 -0.0164119 9.35876 -0.00268804C10.8433 0.0110359 12.2628 0.608698 13.3101 1.661C13.367 1.71783 16.7641 6.13066 16.7641 6.13066C17.7722 7.18965 18.3333 8.59637 18.3309 10.0584C18.3285 11.5204 17.7628 12.9253 16.7513 13.981L14.6283 16.6503C15.8032 19.505 17.5306 22.0995 19.7112 24.2845C21.8919 26.4696 24.4828 28.2022 27.3351 29.3828L30.021 27.247C31.0768 26.2363 32.4814 25.6712 33.943 25.6692C35.4046 25.6671 36.8108 26.2283 37.8695 27.236C37.8695 27.236 42.2805 30.6313 42.3373 30.6882ZM39.8146 33.3538C39.8146 33.3538 35.4275 29.9787 35.3706 29.9218C34.9929 29.5473 34.4826 29.3372 33.9507 29.3372C33.4188 29.3372 32.9085 29.5473 32.5308 29.9218C32.4813 29.9732 28.7835 32.9193 28.7835 32.9193C28.5343 33.1177 28.2377 33.2477 27.923 33.2966C27.6083 33.3454 27.2862 33.3115 26.9886 33.198C23.2935 31.8222 19.9372 29.6684 17.147 26.8823C14.3568 24.0963 12.198 20.7431 10.8168 17.05C10.6943 16.7483 10.6544 16.4195 10.7011 16.0973C10.7478 15.7751 10.8795 15.4711 11.0826 15.2167C11.0826 15.2167 14.0288 11.517 14.0783 11.4693C14.4528 11.0916 14.6629 10.5813 14.6629 10.0494C14.6629 9.51754 14.4528 9.00719 14.0783 8.6295C14.0215 8.5745 10.6463 4.18366 10.6463 4.18366C10.263 3.83993 9.76264 3.65584 9.24792 3.66913C8.73321 3.68243 8.24307 3.8921 7.87797 4.25517L5.76964 6.0885C-4.57403 18.5258 27.0895 48.433 37.9886 38.1333L39.6588 36.2083C40.0502 35.8458 40.2853 35.3453 40.3143 34.8126C40.3434 34.2799 40.1642 33.7568 39.8146 33.3538Z"
									fill="#FEED01"
								/>
							</svg>
							<div>
								<p>Гаряча лінія</p>
								{/*todo get here departments phone number*/}
								<address>+380 68 94 03 939</address>
							</div>
						</div>
						<div className={`btn yellow xxl brown ${styles.infoBtn}`}>
							<svg
								xmlns="http://www.w3.org/2000/svg"
								width="45"
								height="44"
								viewBox="0 0 45 44"
								fill="none"
							>
								<path
									d="M22.3335 44C10.2023 44 0.333496 34.1312 0.333496 22C0.333496 9.86883 10.2023 0 22.3335 0C34.4647 0 44.3335 9.86883 44.3335 22C44.3335 34.1312 34.4647 44 22.3335 44ZM22.3335 3.66667C12.2245 3.66667 4.00016 11.891 4.00016 22C4.00016 32.109 12.2245 40.3333 22.3335 40.3333C32.4425 40.3333 40.6668 32.109 40.6668 22C40.6668 11.891 32.4425 3.66667 22.3335 3.66667ZM26.9168 29.9383C27.795 29.4323 28.0957 28.3103 27.5878 27.434L24.1668 21.5087V11C24.1668 9.988 23.3473 9.16667 22.3335 9.16667C21.3197 9.16667 20.5002 9.988 20.5002 11V22C20.5002 22.3227 20.5845 22.638 20.7458 22.9167L24.4125 29.2673C24.7535 29.8558 25.3677 30.184 26.002 30.184C26.3137 30.184 26.629 30.1052 26.9168 29.9383Z"
									fill="#FEED01"
								/>
							</svg>
							<div>
								<p>Працюємо</p>
								<address>пн - сб з 9:00 - 20:00</address>
							</div>
						</div>
						<Link
							href={"/contacts"}
							className={`btn yellow xxl ${styles.infoBtn}`}
						>
							<svg
								xmlns="http://www.w3.org/2000/svg"
								width="45"
								height="44"
								viewBox="0 0 45 44"
								fill="none"
							>
								<path
									d="M35.4998 3.66667H33.6665V1.83333C33.6665 1.3471 33.4734 0.880788 33.1295 0.536971C32.7857 0.193154 32.3194 0 31.8332 0C31.3469 0 30.8806 0.193154 30.5368 0.536971C30.193 0.880788 29.9998 1.3471 29.9998 1.83333V3.66667H15.3332V1.83333C15.3332 1.3471 15.14 0.880788 14.7962 0.536971C14.4524 0.193154 13.9861 0 13.4998 0C13.0136 0 12.5473 0.193154 12.2035 0.536971C11.8597 0.880788 11.6665 1.3471 11.6665 1.83333V3.66667H9.83317C7.40291 3.66958 5.07303 4.63628 3.35457 6.35474C1.63612 8.07319 0.669415 10.4031 0.666504 12.8333V34.8333C0.669415 37.2636 1.63612 39.5935 3.35457 41.3119C5.07303 43.0304 7.40291 43.9971 9.83317 44H35.4998C37.9301 43.9971 40.26 43.0304 41.9784 41.3119C43.6969 39.5935 44.6636 37.2636 44.6665 34.8333V12.8333C44.6636 10.4031 43.6969 8.07319 41.9784 6.35474C40.26 4.63628 37.9301 3.66958 35.4998 3.66667ZM4.33317 12.8333C4.33317 11.3746 4.91263 9.9757 5.94408 8.94425C6.97553 7.9128 8.37448 7.33333 9.83317 7.33333H35.4998C36.9585 7.33333 38.3575 7.9128 39.3889 8.94425C40.4204 9.9757 40.9998 11.3746 40.9998 12.8333V14.6667H4.33317V12.8333ZM35.4998 40.3333H9.83317C8.37448 40.3333 6.97553 39.7539 5.94408 38.7224C4.91263 37.691 4.33317 36.292 4.33317 34.8333V18.3333H40.9998V34.8333C40.9998 36.292 40.4204 37.691 39.3889 38.7224C38.3575 39.7539 36.9585 40.3333 35.4998 40.3333Z"
									fill="currentColor"
								/>
								<path
									d="M22.6665 30.25C24.1853 30.25 25.4165 29.0188 25.4165 27.5C25.4165 25.9812 24.1853 24.75 22.6665 24.75C21.1477 24.75 19.9165 25.9812 19.9165 27.5C19.9165 29.0188 21.1477 30.25 22.6665 30.25Z"
									fill="currentColor"
								/>
								<path
									d="M13.4998 30.25C15.0186 30.25 16.2498 29.0188 16.2498 27.5C16.2498 25.9812 15.0186 24.75 13.4998 24.75C11.9811 24.75 10.7498 25.9812 10.7498 27.5C10.7498 29.0188 11.9811 30.25 13.4998 30.25Z"
									fill="currentColor"
								/>
								<path
									d="M31.8332 30.25C33.352 30.25 34.5832 29.0188 34.5832 27.5C34.5832 25.9812 33.352 24.75 31.8332 24.75C30.3144 24.75 29.0832 25.9812 29.0832 27.5C29.0832 29.0188 30.3144 30.25 31.8332 30.25Z"
									fill="currentColor"
								/>
							</svg>
							<div>
								<p>Запис на прийом</p>
								<address>Записатись зараз</address>
							</div>
						</Link>
					</div>
				</div>
			</section>
			<section className="news">NEWS</section>
			<section className={`container ${styles.whatWeTreatSection}`}>
				<article>
					<h2 className={"title left md"}>Що ми лікуємо</h2>
					<Suspense fallback={<WhatWeTreatHomeListsFallback />}>
						<WhatWeTreatHomeLists whatWeTreatList={whatWeTreatList} />
					</Suspense>
				</article>
				{/*todo change to good quality picture*/}
				<div className={styles.img}>
					<Image src={doctor} alt={"Doctor"} />
				</div>
			</section>
			<section className={`container ${styles.howWeTreatSection}`}>
				<h2 className={"title left md"}>Як ми лікуємо</h2>
				<p>
					Дізнайтеся більше про наші методи фізичноі терапії, які забезпечуть
					ефективне відновлення та тривалий результат.
				</p>
			</section>
			<section className="">OUR SERVICES </section>
			<section className="">OUR GOAL</section>
			<section className="">REVIEWS</section>
			<section className="">FAQ</section>
		</div>
	);
}
