import styles from "./OurServicesList.module.scss";
import DetailsDropdownList from "@/app/common_ui/animated_components/DetailsDropdownList/DetailsDropdownList";

const list = [
	{
		title: "Реабілітація для дорослих",
		text: "Індивідуальні та доказові програми відновлення, що допомагають позбутися хронічного болю, повернутися до активного життя після травм, операцій і хвороб.",
	},
	{
		title: "Реабілітація для дітей",
		text: "Спеціалізовані методики спрямовані на лікування та корекцію порушень постави, деформацій хребта та інших проблем опорно-рухового апарату.",
	},
	{
		title: "Консультації лікарів",
		text: "Професійна діагностика та створення персонального плану лікування спрямованого на довготривалий результат.",
	},
	{
		title: "Фізіотерапія",
		text: "Комплексні фізіотерапевтичні процедури, спрямовані на зменшення болю, покращення рухливості та загального самопочуття.",
	},
	{
		title: "Масаж",
		text: "Застосування ефективних м’яких мануальних технік для зняття м’язевої та психологічної напруги, прискорення процесу відновлення для кожного пацієнта.",
	},
];

export default function OurServicesList() {
	return (
		<div className={styles.container}>
			{list.map((item, i) => {
				return <DetailsDropdownList title={item.title} text={item.text} key={i} />;
			})}
		</div>
	);
}
